export class CoffeeFactsData {

  private readonly facts;

  getData(){
    return this.facts;
  }

  constructor() {
    this.facts = [
      {
        title: `שתי מדינות בלבד אחראיות לחצי מכמות פולי הקפה בעולם!`,
        body: `כאשר כמעט מאה אחוזים מהסביבה שלנו צורכת קפה באופן קבוע, קשה להאמין שצמד מדינות בלבד מספקות כמות אסטרונומית כזו של קפה.
אולי כבר הצלחתם לנחש, המדינות בעלות תרבות הקפה העשירה ביותר ואחוזי הייצוא הגבוהים ביותר הן ברזיל וקולומביה. ויוה לה לאטה!               `
      },
      {
        title: `בעולם, מכנים את הקפה ההפוך שלנו בשם המפוצץ “קפוצ’ינו”. אך אי פעם תהיתם מה מקור השם?`,
        body: `מקור השם קפוצ’ינו מגיע מאיטליה, אך מכיוון בלתי צפוי. שמו של המשקה נובע ממסדר נזירי הקפצ’ון האיטלקיים שחבבו וייצרו קפה, נזירים אשר מלבושם המסורתי הוא בצבע המתקבל בהכנת כוס קפוצ’ינו, שילוב של גווני חום ואדמה.
אם נלך עוד אחורה, נגלה ששמו של מסדר הנזירים הוא גם אותו מקום ממנו הגיעה המילה קפוצ’ון שכולנו מכירים. מדוע? נזירי הקפצ’ון היו הראשונים שנהגו לחבוש ברדס על ראשם כחלק מהתלבושת המסורתית.             `
      },
      {
        title: `במאה ה-17, שתיית קפה הפכה למנהג לא חוקי באנגליה!`,
        body: `אולי שמעתם על תקופת היובש בארה”ב, תקופה בה נחקק חוק היובש שאסר על שתיית ומכירת אלכוהול ברחבי ארה”ב,
         והחזיק מעמד יותר מעשר שנים, בין השנים 1920-1933. אך האם ידעתם שבשנת 1675 באנגליה,
         המלך צ’ארלס השני החליט לאסור על שתיית קפה וסגר את כל בתי הקפה?
         המלך הפרנואיד האמין ששתייני הקפה שיושבים בבתי הקפה זוממים להפיל אותו מכיסאו!`
      },
      {
        title: `פולי קפה הם המצרך השני הפופולרי ביותר בעולם!`,
        body: `מכל המוצרים, סחורות, זנים וסוגי תוצרים הנסחרים בעולם, קפה מחזיק במקום השני המכובד, רק מקום אחד אחר הדלק,
             מוצר שבלעדיו החברה המערבית אינה יכולה להתקיים.
              אם שואלים אותנו, גם הךי קפה החברה המערבית לא תצליח להתקיים! למעשה, קפה הוא מוצר שנסחר בתדירות כל כך גבוהה,
           עד כדי כך שכלכלה של מדינות מסוימות, בעיקר באמריקה הלטינית, תקרוס לחלוטין ללא מסחר בקפה.  `
      },
      {
        title: `אתם יודעים לאן נעלם הקפאין בקפה נטול הקפאין שלכם?`,
        body: `אנחנו תיארנו לעצמנו שפולי הקפה עוברים תהליך בו מסירים את הקפאין מהם עד לבלי שוב.
         למעשה, המציאות היצרנית של היום היא לגמרי אחרת. יצרני קפה שומרים את הקפאין הנוצר בתהליך ניקוי הפולים ומשתמשים בו בשנית.
         תמציות הקפאין המרוכזות מתאימות למכירה חוזרת ונרכשות על ידי חברות של משקאות קלים ומוגזים עתירי קפאין ויצרני תרופות שונות.`
      },
      {
        title: `כמה כוסות קפה אתם שותים ביום?`,
        body: `אחד מאוהבי הקפה המפורסמים בעולם היה אונורה דה בלזק,
         סופר צרפתי נודע בן המאה ה-19 (“הקומדיה האנושית”). הוא נהג ללגום 40 ספלי קפה מדי יום!`
      },
      {
        title: `.60 פולים בדיוק`,
        body: `60 פולי קפה – זו כמות פולי הקפה שבטהובן אהב במשקה שלו. והוא ספר אותם במדויק פעם אחר פעם.`
      },
      {
        title: `כמה פולי קפה יש בקילוגרם?`,
        body: `קילוגרם קפה קלוי עשוי מ-4,000-5,000 פולי קפה.`
      },
      {
        title: `על שם מה נקרא הקפה?`,
        body: `הקפה נקרא בכלל על שם יין? – המילה “קפה” שאובה מהמילה הערבית “קהווה”. חוקרי שפה רבים סברו שמשמעותה המקורית של המילה הוא “יין”.
         זאת מכיוון שהקפה נחשב לתחליף יין באיסלאם, בו אסורה שתיית אלכוהול. לעומתם,
         יש חוקרים שמאמינים שמקור המילה הוא באיזור קאפא באתיופיה,
         שם התגלו לראשונה שיחי הקפה במאה ה-11.`
      },
      {
        title: `ייעול תהליך הכנת קפה במשרד.`,
        body: `הראשון לייעל את תהליך הכנת הקפה במשרד היה עוז,
         שהיה מתחיל להכין כוס קפה חדשה עוד לפני שסיים את הקודמת`
      },
      {
        title: `מלח לימון.`,
        body: `אחת מכל 3 פעמים שמנקים את הקומקום עם מלח לימון,
         יש מי שמכין לעצמו קפה מבלי להחליף את המים`
      },
      {
        title: `בית הקפה הראשון.`,
        body: `בית הקפה הראשון בעולם נפתח בשנת 1475 בקושטא (איסטנבול של ימינו).`
      }
    ]
  }
}
